uhnp/src/Reports/ОтчетПоПроизвольномуЗапросуВИБ/ОтчетПоПроизвольномуЗапросуВИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоПроизвольномуЗапросуВИБ</name>
  <attributes>
    <name>ИспользуемаяИБ</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабПравилаВычисленияПараметров</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Report>

uhnp/src/Reports/ОтчетПоПроизвольномуЗапросуВИБ/ObjectModule.bsl
///////////////////////////////////////////////////
// Рабочие COM - объекты
Перем ТекСоединениеВИБ Экспорт; // Текущее соединение с внешней информационной базой
Перем ОбъектЗапрос; // Запрос внешней информационной базы

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем ПравилаВычисленияПараметровЗапроса Экспорт;
Перем ПравилаИспользованияПолейЗапроса Экспорт;
Перем КонтекстОтчета Экспорт;

Перем АдресХранилищаПеременныхДляРасчета Экспорт;

//////////////////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции формирования отчетов
//////////////////////////////////////////////////////////////////////////////////////////////

Процедура ПолучитьСоединениеВИБ() Экспорт
	
	ТекСоединениеВИБ = УправлениеСоединениямиВИБУХ.ПолучитьСоединение(ИспользуемаяИБ, 1);
			
КонецПроцедуры // ПолучитьСоединениеВИБ()

//////////////////////////////////////////////////////////////////////////////////////////////

Функция СформироватьОтчет() Экспорт
	
	ПолучитьСоединениеВИБ();
	
	Если ТекСоединениеВИБ=Неопределено Тогда
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;
	
	СтруктураЗапроса=Новый Структура("СтруктураПолей",Новый Структура("ПоляЗапроса",ПравилаИспользованияПолейЗапроса));	
	СтруктураЗапроса.Вставить("ТекстЗапроса",ТекстЗапроса);	
	СтруктураЗапроса.Вставить("ТаблицаВычисленияПараметров",ПравилаВычисленияПараметровЗапроса);
	СтруктураЗапроса.Вставить("ВИБ",Новый Структура("ВИБ,ТипПодключения",ИспользуемаяИБ,0));
	СтруктураЗапроса.Вставить("ПроизвольныйЗапрос",Ложь);
	СтруктураЗапроса.Вставить("ТаблицаАналитикиВИБ");
		
	ДанныеДляЗапроса=ИнтеграцияСВнешнимиСистемамиУХ.ПодготовитьДанныеДляНастройкиЗапроса(СтруктураЗапроса);
	
	СтруктураПараметров=Новый Структура;
	СтруктураПараметров.Вставить("ДанныеДляЗапроса",ДанныеДляЗапроса);
	СтруктураПараметров.Вставить("ВидОтчета","ПроизвольныйЗапрос");
	СтруктураПараметров.Вставить("ВнешняяИБ",1);
	
	ДанныеДляЗаголовка				= Новый Структура;
	ДанныеДляЗаголовка.Вставить("ИспользуемаяИБ",ИспользуемаяИБ.Наименование);
	
	СтруктураПараметров.Вставить("ДанныеДляЗаголовка",ДанныеДляЗаголовка);
		
	Если ТипЗнч(ТекСоединениеВИБ) = Тип("WSProxy") Тогда
				
		ДанныеДляОтображения= ТекСоединениеВИБ.GetDataForReportRegister(Новый ХранилищеЗначения(СтруктураПараметров, Новый СжатиеДанных(9)),
					Новый ХранилищеЗначения(Новый Структура, Новый СжатиеДанных(9))).Получить();
					
		Возврат ДанныеДляОтображения.ТаблицаДляОтображения;
		
	ИначеЕсли ТипЗнч(ТекСоединениеВИБ) = Тип("Строка") Тогда
		
		ДанныеДляОтображения=РаботаСОбъектамиМетаданныхВнешнийУХ.ПолучитьОтвет1СШина(ТекСоединениеВИБ,"GetDataForReportRegister",СтруктураПараметров);
		
		Если ДанныеДляОтображения=Неопределено Тогда
			
			Возврат Новый ТабличныйДокумент;
			
		Иначе
			
			Возврат ДанныеДляОтображения.ТаблицаДляОтображения;
			
		КонецЕсли;
		
	Иначе
		
		ДанныеДляОтображения= РаботаСОбъектамиМетаданныхВнешнийУХ.GetDataForReportRegister(ТекСоединениеВИБ,СтруктураПараметров);
		
		Возврат ДанныеДляОтображения.ТаблицаДляОтображения;
		
	КонецЕсли;
			
КонецФункции // СформироватьОтчет() 

///////////////////////////////////////////////////////////////////////////////////////////

Процедура ВосстановитьПеременныеДляРасчета(ПеременныеДляРасчета=Неопределено) Экспорт
	
	Если ПеременныеДляРасчета=Неопределено Тогда
		ПеременныеДляРасчета=ПолучитьИзВременногоХранилища(АдресХранилищаПеременныхДляРасчета);
	КонецЕсли;
	
	Если ТипЗнч(ПеременныеДляРасчета)=Тип("Структура") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ПеременныеДляРасчета);
		
	КонецЕсли;
			
КонецПроцедуры // ВосстановитьПеременныеДляРасчета()

Функция ПодготовитьСтруктуруПеременныхДляРасчета() Экспорт
		
	СтруктураПеременных=Новый Структура;
	СтруктураПеременных.Вставить("Ссылка");
	СтруктураПеременных.Вставить("РеквизитыОбъекта",ОбщегоНазначенияУХ.ПолучитьСтруктуруРеквизитовОбъекта(ЭтотОбъект));
	СтруктураПеременных.Вставить("ПроцедураСозданияОбъекта","Отчеты.ОтчетПоПроизвольномуЗапросуВИБ.Создать()");
	СтруктураПеременных.Вставить("ПравилаИспользованияПолейЗапроса",ПравилаИспользованияПолейЗапроса);
	СтруктураПеременных.Вставить("ПравилаВычисленияПараметровЗапроса",ПравилаВычисленияПараметровЗапроса);

	Возврат СтруктураПеременных;
	
КонецФункции // ПодготовитьСтруктуруПеременныхДляРасчета()
